pattern_dict = {
    'doc_number': [r'\b[А-Яа-яA-Za-z]{3}\b \d{7}',  # номер диплома
                   r'\b\d{7} \d{7}\b',
                   r'\b\d{6} \d{7}\b',  # номер диплома специалиста
                   r'\b\d{6} \d{6}\b',
                   r'\b\d{4} \d{8}\b',  # номер диплома о переподготовке/номер удост-я о повышении квал-ии
                   r'\b\d{2} \d{6}\b',
                   r'\b\d{13}\b',
                   r'\b\d{12}\b',
                   r'\b\d{6}\b',
                   r'\b\d{5}\b'
                   ],  # номер сертификата специалиста

    'date': [r'\d{1,2} \b\w+\b \d{4} \w{4}',
             r'\d{1,2} \b\w+\b \d{4} \w+',
             r'\d{1,2} \b\w+\b \d{4} \w\.',
             r'\d{1,2}\.d{1,2}\.\d{4} \w{4}',
             r'\d{1,2}\.\d{1,2}\.\d{4} \w\.',
             r'\d{1,2}\.\d{1,2}\.\d{4}',
             r'\d{1,2}\s+\b\w+\b\s+\d{4}(?:\s+\w*\b)?']
}

ALLOWED_MIME_TYPES = {'application/pdf'}  # Допустимые MIME-типы для PDF

WORD_LIST = ['диплом', 'серт', 'спец', 'програм', 'документ', 'дата']
